In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.7 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///ABC_DATA.db

In [4]:
%%sql CREATE TABLE Customers(
    customer_id INT NOT NULL PRIMARY KEY,
    first_name VARCHAR (20),
    last_name VARCHAR(20),
    email VARCHAR (30)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [5]:
%%sql INSERT INTO Customers (customer_id,first_name,last_name,email) VALUES
(1, 'John', 'Doe', 'johndoe@email.com'),
(2, 'Jane', 'Smith', 'janesmith@email.com'),
(3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
(4, 'Alice', 'Brown', 'alicebrown@email.com'),
(5, 'Charlie', 'Davis', 'charliedavis@email.com'),
(6, 'Eva', 'Fisher', 'evafisher@email.com'),
(7, 'George', 'Harris', 'georgeharris@email.com'),
(8, 'Ivy', 'Jones', 'ivyjones@email.com'),
(9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
(10, 'Lily', 'Nelson', 'lilynelson@email.com'),
(11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
(12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
(13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [6]:
%sql SELECT * FROM Customers;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [7]:
%%sql CREATE TABLE PRODUCTS(
    product_id INT NOT NULL PRIMARY KEY,
    product_name VARCHAR (30),
    price DECIMAL (2,2)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [8]:
%%sql INSERT INTO PRODUCTS (product_id,product_name,price) VALUES
(1, 'Product A', 10.00),
(2, 'Product B', 15.00),
(3, 'Product C', 20.00),
(4, 'Product D', 25.00),
(5, 'Product E', 30.00),
(6, 'Product F', 35.00),
(7, 'Product G', 40.00),
(8, 'Product H', 45.00),
(9, 'Product I', 50.00),
(10, 'Product J', 55.00),
(11, 'Product K', 60.00),
(12, 'Product L', 65.00),
(13, 'Product M', 70.00);

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [9]:
%sql SELECT * FROM PRODUCTS;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 10),
 (2, 'Product B', 15),
 (3, 'Product C', 20),
 (4, 'Product D', 25),
 (5, 'Product E', 30),
 (6, 'Product F', 35),
 (7, 'Product G', 40),
 (8, 'Product H', 45),
 (9, 'Product I', 50),
 (10, 'Product J', 55),
 (11, 'Product K', 60),
 (12, 'Product L', 65),
 (13, 'Product M', 70)]

In [10]:
%%sql CREATE TABLE Orders(
    order_id INT NOT NULL PRIMARY KEY,
    customer_id INT,
    order_date DATE
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [11]:
%%sql INSERT INTO Orders (order_id,customer_id,order_date) VALUES
(1, 1, '2023-05-01'),
(2, 2, '2023-05-02'),
(3, 3, '2023-05-03'),
(4, 1, '2023-05-04'),
(5, 2, '2023-05-05'),
(6, 3, '2023-05-06'),
(7, 4, '2023-05-07'),
(8, 5, '2023-05-08'),
(9, 6, '2023-05-09'),
(10, 7, '2023-05-10'),
(11, 8, '2023-05-11'),
(12, 9, '2023-05-12'),
(13, 10, '2023-05-13'),
(14, 11, '2023-05-14'),
(15, 12, '2023-05-15'),
(16, 13, '2023-05-16');

 * sqlite:///ABC_DATA.db
16 rows affected.

[]

In [12]:
%sql SELECT * FROM Orders;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [13]:
%%sql CREATE TABLE Order_items(
    order_id INT,
    product_id INT,
    quantity INT
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [14]:
%%sql INSERT INTO Order_items (order_id,product_id,quantity) VALUES
(1, 1, 2),
(1, 2, 1),
(2, 2, 1),
(2, 3, 3),
(3, 1, 1),
(3, 3, 2),
(4, 2, 4),
(4, 3, 1),
(5, 1, 1),
(5, 3, 2),
(6, 2, 3),
(6, 1, 1),
(7, 4, 1),
(7, 5, 2),
(8, 6, 3),
(8, 7, 1),
(9, 8, 2),
(9, 9, 1),
(10, 10, 3),
(10, 11, 2),
(11, 12, 1),
(11, 13, 3),
(12, 4, 2),
(12, 5, 1),
(13, 6, 3),
(13, 7, 2),
(14, 8, 1),
(14, 9, 2),
(15, 10, 3),
(15, 11, 1),
(16, 12, 2),
(16, 13, 3);

 * sqlite:///ABC_DATA.db
32 rows affected.

[]

In [15]:
%sql SELECT * FROM Order_items;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

In [16]:
%sql SELECT name FROM sqlite_master WHERE type="table";

 * sqlite:///ABC_DATA.db
Done.

[('Customers',), ('PRODUCTS',), ('Orders',), ('Order_items',)]

In [17]:
%sql SELECT * FROM PRODUCTS WHERE price=(SELECT Max(price) FROM PRODUCTS);

 * sqlite:///ABC_DATA.db
Done.

[(13, 'Product M', 70)]

In [18]:
%sql SELECT * FROM PRODUCTS ORDER BY price DESC LIMIT 1;

 * sqlite:///ABC_DATA.db
Done.

[(13, 'Product M', 70)]

In [19]:
%sql SELECT order_id, quantity FROM Order_items ORDER BY quantity DESC LIMIT 1;

 * sqlite:///ABC_DATA.db
Done.

[(4, 4)]

In [20]:
%%sql SELECT order_id
FROM Order_items
GROUP BY quantity
ORDER BY order_id DESC
LIMIT 1;

 * sqlite:///ABC_DATA.db
Done.

[(4,)]

In [21]:
%%sql SELECT order_id
FROM Order_items
GROUP BY order_id
ORDER BY quantity DESC
LIMIT 1;

 * sqlite:///ABC_DATA.db
Done.

[(4,)]

In [22]:
%sql SELECT COUNT(quantity) FROM Order_items;

 * sqlite:///ABC_DATA.db
Done.

[(32,)]

In [23]:
%%sql WITH order_counts AS (SELECT customer_id, COUNT(order_id) AS order_count
    FROM Orders
    GROUP BY customer_id),
max_order_count AS (
    SELECT MAX(order_count) AS max_count
    FROM order_counts
)
SELECT c.first_name, c.last_name
FROM Customers c
JOIN order_counts oc ON c.customer_id = oc.customer_id
JOIN max_order_count moc ON oc.order_count = moc.max_count;

 * sqlite:///ABC_DATA.db
Done.

[('John', 'Doe'), ('Jane', 'Smith'), ('Bob', 'Johnson')]

In [36]:
%%sql SELECT p.product_name,
       p.price * SUM(oi.quantity) AS total_revenue
FROM PRODUCTS p
JOIN Order_items oi ON oi.product_id = p.product_id
GROUP BY p.product_id, p.product_name
ORDER BY total_revenue DESC;

 * sqlite:///ABC_DATA.db
Done.

[('Product M', 420),
 ('Product J', 330),
 ('Product F', 210),
 ('Product L', 195),
 ('Product K', 180),
 ('Product C', 160),
 ('Product I', 150),
 ('Product B', 135),
 ('Product H', 135),
 ('Product G', 120),
 ('Product E', 90),
 ('Product D', 75),
 ('Product A', 50)]

In [43]:
%sql SELECT * FROM Orders;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [50]:
%sql SELECT * FROM Customers;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

Find the first order (by date) for each customer.

In [51]:
%%sql SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    o.order_id,
    o.order_date
FROM
    customers c
JOIN
    orders o ON c.customer_id = o.customer_id
JOIN
    (SELECT
        customer_id,
        MIN(order_date) AS first_order_date
     FROM
        orders
     GROUP BY
        customer_id) first_orders
ON
    o.customer_id = first_orders.customer_id
    AND o.order_date = first_orders.first_order_date;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 1, '2023-05-01'),
 (2, 'Jane', 'Smith', 2, '2023-05-02'),
 (3, 'Bob', 'Johnson', 3, '2023-05-03'),
 (4, 'Alice', 'Brown', 7, '2023-05-07'),
 (5, 'Charlie', 'Davis', 8, '2023-05-08'),
 (6, 'Eva', 'Fisher', 9, '2023-05-09'),
 (7, 'George', 'Harris', 10, '2023-05-10'),
 (8, 'Ivy', 'Jones', 11, '2023-05-11'),
 (9, 'Kevin', 'Miller', 12, '2023-05-12'),
 (10, 'Lily', 'Nelson', 13, '2023-05-13'),
 (11, 'Oliver', 'Patterson', 14, '2023-05-14'),
 (12, 'Quinn', 'Roberts', 15, '2023-05-15'),
 (13, 'Sophia', 'Thomas', 16, '2023-05-16')]

What’s the total revenue per product?

In [55]:
%%sql SELECT
    p.product_id,
    p.product_name,
    SUM(p.price * oi.quantity) AS total_revenue
FROM
    products p
JOIN
    order_items oi ON p.product_id = oi.product_id
GROUP BY
    p.product_id, p.product_name
ORDER BY
    total_revenue ASC;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 50),
 (4, 'Product D', 75),
 (5, 'Product E', 90),
 (7, 'Product G', 120),
 (2, 'Product B', 135),
 (8, 'Product H', 135),
 (9, 'Product I', 150),
 (3, 'Product C', 160),
 (11, 'Product K', 180),
 (12, 'Product L', 195),
 (6, 'Product F', 210),
 (10, 'Product J', 330),
 (13, 'Product M', 420)]

Find the day with the highest revenue.

In [59]:
%%sql SELECT
    order_date,
    SUM(p.price * oi.quantity) AS daily_revenue
FROM
    orders o
JOIN
    order_items oi ON o.order_id = oi.order_id
JOIN
    products p ON oi.product_id = p.product_id
GROUP BY
    order_date
ORDER BY
    daily_revenue DESC
LIMIT 1;

 * sqlite:///ABC_DATA.db
Done.

[('2023-05-16', 340)]